04_OpenFoam/_ref/OpenFOAM-14/multicomponentFluid/lockExchange/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [velocity];

internalField   uniform (0 0 0);

boundaryField
{
    left
    {
        type            slip;
    }
    right
    {
        type            slip;
    }
    bottom
    {
        type            slip;
    }
    top
    {
        type            slip;
    }
    frontBack
    {
        type            empty;
    }
}


// ************************************************************************* //
